client/SoapRequests.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>

  <ons:Request ons:reqID="-531b8c0f:10afd3d84b9:-8000" xmlns:ons="http://xml.opendap.org/ns/soap1">
   <ons:GetDDX>
    <ons:DataSet>
     <ons:name>nc/fnoc1.nc</ons:name>
     <ons:ConstraintExpression />
    </ons:DataSet>
   </ons:GetDDX>
  </ons:Request>

  <ons:Request ons:reqID="-531b8c0f:10afd3d84b9:-8400" xmlns:ons="http://xml.opendap.org/ns/soap1">
   <ons:GetDATA>
    <ons:DataSet>
     <ons:name>nc/fnoc1.nc</ons:name>
     <ons:ConstraintExpression>u</ons:ConstraintExpression>
    </ons:DataSet>
   </ons:GetDATA>
  </ons:Request>

  <ons:Request ons:reqID="-531b8c0f:10afd3d84b9:-84560" xmlns:ons="http://xml.opendap.org/ns/soap1">
   <ons:GetTHREDDSCatalog>
    <ons:path>/nc</ons:path>
   </ons:GetTHREDDSCatalog>
  </ons:Request>

  </soapenv:Body>
</soapenv:Envelope>

